In [2]:
import pandas as pd
from datetime import datetime

In [3]:
df = pd.read_excel('transacoes.xlsx')
df

,Tipo,Descrição,Categoria,Valor,Forma de Transação,Ano,Mês,Dia,Hora
0,Entrada,emprestimo,Empréstimos,60.00,Pix,2024,9,1,09:17:50
1,Saída,cbs Valeska,Lazer,30.00,Pix,2024,9,1,09:18:30
2,Saída,Charles,Outros,6.50,Pix,2024,9,3,09:18:57
3,Saída,Ana Paula,Outros,17.32,Pix,2024,9,3,09:19:26
4,Saída,pão,Alimento,0.90,Pix,2024,9,3,09:19:53
...,...,...,...,...,...,...,...,...,...
122,Saída,uber,Transporte,5.60,Pix,2024,9,28,10:39:35
123,Saída,cbs Valeska,Lazer,15.00,Pix,2024,9,28,10:40:03
124,Saída,uber,Transporte,4.00,Pix,2024,9,28,10:40:40
125,Saída,padaria,Alimento,2.70,Pix,2024,9,29,10:41:12
126,Saída,uber,Transporte,6.13,Pix,2024,10,1,09:31:52

In [4]:
df.isnull().sum()

Tipo                  0
Descrição             0
Categoria             0
Valor                 0
Forma de Transação    0
Ano                   0
Mês                   0
Dia                   0
Hora                  0
dtype: int64

In [5]:
df.describe()

             Valor     Ano         Mês         Dia
count   127.000000   127.0  127.000000  127.000000
mean     44.906142  2024.0    9.007874   14.377953
std     139.190912     0.0    0.088736    8.081852
min       0.900000  2024.0    9.000000    1.000000
25%       4.575000  2024.0    9.000000    7.000000
50%       6.500000  2024.0    9.000000   14.000000
75%      20.000000  2024.0    9.000000   21.000000
max    1296.180000  2024.0   10.000000   29.000000

In [6]:
df.groupby('Tipo')['Valor'].sum()

Tipo
Entrada    2676.93
Saída      3026.15
Name: Valor, dtype: float64

In [7]:
df.groupby('Categoria')['Valor'].sum()

Categoria
Alimento        539.77
Empréstimos     327.00
Esposte         129.90
Lazer           360.00
Moradia         600.00
Outros         1149.49
Salário        2131.93
Transporte      264.99
Vestiuário      200.00
Name: Valor, dtype: float64

In [8]:
df.groupby('Forma de Transação')['Valor'].sum()

Forma de Transação
Pix    5703.08
Name: Valor, dtype: float64

In [12]:
soma_entrada = df[df['Tipo'] == 'Entrada']['Valor'].sum()
soma_entrada

np.float64(2676.9300000000003)

In [16]:
cont_entrada = df[df['Tipo'] == 'Entrada']['Valor'].count()
cont_entrada

np.int64(11)

In [13]:
soma_saida = df[df['Tipo'] == 'Saída']['Valor'].sum()
soma_saida

np.float64(3026.1499999999996)

In [18]:
cont_saida = df[df['Tipo'] == 'Saída']['Valor'].count()
cont_saida

np.int64(116)

In [15]:
saldo_total = soma_entrada - soma_saida
saldo_total

np.float64(-349.21999999999935)

In [ ]:
quant_total = cont_entrada + cont_saida